src/DataProcessors/ПроверкаТОВПЗ/ПроверкаТОВПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПроверкаТОВПЗ</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборТО</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ПЗ</name>
      <type>
        <types>DocumentRef.ПроизводственноеЗадание</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/Documents/ВыпускПродукцииКанбан/ВыпускПродукцииКанбан.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыпускПродукцииКанбан</name>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ПланыВыпуска</registerRecords>
  <registerRecords>AccumulationRegister.БракПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.ПередачиВПроизводство</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.КомментарииНеисправностей</types>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Списание</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/DataProcessors/ПроверкаТОВПЗ/Forms/Форма/Module.bsl
&НаСервере
Процедура ПолучитьСписокТО()
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	НормыРасходовСрезПоследних.НормаРасходов.Элемент КАК Элемент
	|ИЗ
	|	РегистрСведений.НормыРасходов.СрезПоследних КАК НормыРасходовСрезПоследних
	|ГДЕ
	|	НормыРасходовСрезПоследних.НормаРасходов.Владелец = &Владелец
	|	И НормыРасходовСрезПоследних.Норма > 0";
Запрос.УстановитьПараметр("Владелец", Объект.НаборТО);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СписокТО.Добавить(ВыборкаДетальныеЗаписи.Элемент);	
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПодобратьСпецификации(ЭтапСпецификации)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	НормыРасходовСрезПоследних.НормаРасходов.Владелец КАК Владелец
	|ИЗ
	|	РегистрСведений.НормыРасходов.СрезПоследних КАК НормыРасходовСрезПоследних
	|ГДЕ
	|	НормыРасходовСрезПоследних.НормаРасходов = &НормаРасходов
	|	И НормыРасходовСрезПоследних.Норма > 0";
Запрос.УстановитьПараметр("НормаРасходов", ЭтапСпецификации);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Не ВыборкаДетальныеЗаписи.Владелец.Канбан.Пустая() Тогда
			Если ВыборкаДетальныеЗаписи.Владелец.Канбан.Служебный Тогда
			ПодобратьСпецификации(ВыборкаДетальныеЗаписи.Владелец);
			Иначе	
			СписокНоменклатуры.Добавить(ВыборкаДетальныеЗаписи.Владелец);
			КонецЕсли;
		Иначе
		ПодобратьСпецификации(ВыборкаДетальныеЗаписи.Владелец);	
		КонецЕсли; 	
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаСервере()
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыпускПродукцииКанбан.Ссылка.ДокументОснование КАК ПЗ
	|ИЗ
	|	Документ.ВыпускПродукцииКанбан КАК ВыпускПродукцииКанбан
	|ГДЕ
	|	ВыпускПродукцииКанбан.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И ВыпускПродукцииКанбан.Изделие В(&СписокНоменклатуры)";
Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Объект.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон", КонецДня(Объект.Период.ДатаОкончания));
Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	флИдентичны = Истина;
		Для каждого Оборудование Из ВыборкаДетальныеЗаписи.ПЗ.Оборудование Цикл	
			Если СписокТО.НайтиПоЗначению(Оборудование.ТехОперация) = Неопределено Тогда
			флИдентичны = Ложь;
			ТЧ = Объект.ТабличнаяЧасть.Добавить();
			ТЧ.ПЗ = ВыборкаДетальныеЗаписи.ПЗ;
			Прервать;
			КонецЕсли;	
		КонецЦикла;
			Если флИдентичны Тогда
				Для каждого ТО Из СписокТО Цикл
					Если ВыборкаДетальныеЗаписи.ПЗ.Оборудование.Найти(ТО.Значение,"ТехОперация") = Неопределено Тогда
					ТЧ = Объект.ТабличнаяЧасть.Добавить();
					ТЧ.ПЗ = ВыборкаДетальныеЗаписи.ПЗ;
					Прервать;
					КонецЕсли;
				КонецЦикла;			
			КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Проверить(Команда)
СписокТО.Очистить();
СписокНоменклатуры.Очистить();
Объект.ТабличнаяЧасть.Очистить();
ПолучитьСписокТО();
Состояние("Обработка...",,"Подбор спецификаций...");
ПодобратьСпецификации(Объект.НаборТО);
Состояние("Обработка...",,"Проверка в производственных заданиях...");
ПроверитьНаСервере();
КонецПроцедуры
